In [12]:
import pandas as pd
import numpy as np

**1.write a python program to implement List-to-Series conversion**

In [6]:
x=[10,20,30,40,50]
series=pd.Series(x)
print("List: ")
print(x)
print("Series: ")
print(series,type(series))

List:
[10, 20, 30, 40, 50]
Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64 <class 'pandas.core.series.Series'>

**2.write a python program to generate the series of data from 1st may,2021 to 12th may,2021(both inclusive)**

In [7]:
start='2021-05-01'
end='2021-05-12'
x=pd.date_range(start=start,end=end)
for date in x:
    print(date.strftime('%Y-%m-%d'))

2021-05-01
2021-05-02
2021-05-03
2021-05-04
2021-05-05
2021-05-06
2021-05-07
2021-05-08
2021-05-09
2021-05-10
2021-05-11
2021-05-12

**3.Given a dictinary,convert it into corresponding dataframe and display it**

In [11]:
data={'name':['Aswin','Bhavana','Deepak','Aaron'],
      'age':[22,22,21,22],
      'city':['Thamalam','Kunnumpuram','Chembazhanthy','Ulloor']}
df=pd.DataFrame(data)
print(df)

      name  age           city
0    Aswin   22       Thamalam
1  Bhavana   22    Kunnumpuram
2   Deepak   21  Chembazhanthy
3    Aaron   22         Ulloor

**4.Given a 2D list,convert it into corresponding dataframe and display it**

In [12]:
data=[['Aswin',22,'Thamalam'],['Bhavana',22,'Kunnumpuram'],['Deepak',21,'Chembazhanthy']]
df=pd.DataFrame(data,columns=['Name','Age','City'])
print(df)

      Name  Age           City
0    Aswin   22       Thamalam
1  Bhavana   22    Kunnumpuram
2   Deepak   21  Chembazhanthy

**5.Given a CSV file,read it into dataframe and display it**

In [15]:
df=pd.read_csv('4.csv')
print(df)

      Name  Age          Place
0  Bhavana   22    Kunnumpuram
1    Aswin   22       Thamalam
2   Deepak   21  Chembazhanthy

**6.Given a dataframe,sort it by multiple columns**.

In [19]:
data={'name':['babu','aswin','thappu','aaron','akhil','aswin','thappu'],
      'age':['22','23','21','24','25','20','24']}
df=pd.DataFrame(data)
print("Original Dataframe: ")
print(df)

df_sorted_asc=df.sort_values(by=['name','age'])
print("\nDataframe sorted by name then age(ascending):")
print(df_sorted_asc)

Original Dataframe:
     name age
0    babu  22
1   aswin  23
2  thappu  21
3   aaron  24
4   akhil  25
5   aswin  20
6  thappu  24

Dataframe sorted by name then age(ascending):
     name age
3   aaron  24
4   akhil  25
5   aswin  20
1   aswin  23
0    babu  22
2  thappu  21
6  thappu  24

**7.given a dataframe with custom indexing,convert it to default indexing and display it**

In [4]:
data={'name':['Aswin','Bhavana','Deepak','Aaron'],
      'age':[22,22,21,22],
      'city':['Thamalam','Kunnumpuram','Chembazhanthy','Ulloor']}
index=['a','b','c','d']
df=pd.DataFrame(data,index=index)
print("original df: ")
print(df)
print("\n"+"="*30 + "\n")
newdf=df.reset_index(drop=True)
print("df with default index: ")

print(newdf)

original df:
      name  age           city
a    Aswin   22       Thamalam
b  Bhavana   22    Kunnumpuram
c   Deepak   21  Chembazhanthy
d    Aaron   22         Ulloor

==============================

df with default index:
      name  age           city
0    Aswin   22       Thamalam
1  Bhavana   22    Kunnumpuram
2   Deepak   21  Chembazhanthy
3    Aaron   22         Ulloor

**8.Given a dataframe,select first 2 rows and output them.**

In [5]:
data={'name':['Aswin','Bhavana','Deepak','Aaron'],
      'age':[22,22,21,22],
      'city':['Thamalam','Kunnumpuram','Chembazhanthy','Ulloor']}
df=pd.DataFrame(data)
first_two_rows=df.head(2)
print(first_two_rows)

      name  age         city
0    Aswin   22     Thamalam
1  Bhavana   22  Kunnumpuram

**9.Given a dataframe showing name,occupation,salary of people.Find the average salary per occupation.**

In [6]:
data={'name':['Aswin','Bhavana','Deepak','Aaron','Akhil'],
      'occupation':['gamer','teacher','police','teacher','gamer'],
      'salary':[10000,20000,30000,10000,15000]}
df=pd.DataFrame(data)
salaries=df.groupby('occupation')['salary'].mean()
print(salaries)

occupation
gamer      12500.0
police     30000.0
teacher    15000.0
Name: salary, dtype: float64

**10.Given a dataframe with NaN values,fill the NaN values with 0**

In [8]:
data={'A':[1,2,np.nan,4],
      'B':[5,np.nan,7,8],
      'C':[np.nan,10,11,12]}
df=pd.DataFrame(data)
print("original df: ")
print(df)
print("\n"+"="*30 + "\n")
df_filled=df.fillna(0)
print("Dataframe after filling NaN with 0: ")
print(df_filled)

original df:
     A    B     C
0  1.0  5.0   NaN
1  2.0  NaN  10.0
2  NaN  7.0  11.0
3  4.0  8.0  12.0

==============================

Dataframe after filling NaN with 0:
     A    B     C
0  1.0  5.0   0.0
1  2.0  0.0  10.0
2  0.0  7.0  11.0
3  4.0  8.0  12.0

**11.Given is a dataframe company names and corresponding profits. Convert the values of profit column such that values in it greater than 0 are set to true adn the rest are set to false**

In [10]:
data = {'cname' : ['comapny A', 'Company B', 'Company C',' Company D', 'Company E'], 
        'profit' :[10000, -5000, 0, 2500, -100]}

df= pd.DataFrame(data)
print(df)
print("\n" + "="*30 +"\n")

df['profit'] = df['profit']  > 0
print("DataFrame after Converting 'Profit Column : ")
print(df)

        cname  profit
0   comapny A   10000
1   Company B   -5000
2   Company C       0
3   Company D    2500
4   Company E    -100

==============================

DataFrame after Converting 'Profit Column :
        cname  profit
0   comapny A    True
1   Company B   False
2   Company C   False
3   Company D    True
4   Company E   False

**12.Given are 2 dataframe, with one dataframe containing Employee ID, Employee Name, and stipend and the other Dataframe containing Employee ID and designation. Output the DataFrame containing Employee ID, Employee name, Stipend and position**

In [14]:
data1 = {'eid' : [101, 102, 103, 104],
         'ename' : ['Babu', 'Theng', 'vazha', 'plav'],
         'stipend' : [50000, 60000, 75000, 55000]
         }
df1 = pd.DataFrame(data1)
data2 = {'eid' : [101,102,103,104],
         'designation' : ['Manager', 'Analyst', 'Supervisor', 'Trainee']}
df2 = pd.DataFrame(data2)

merged_df = pd.merge(df1, df2, on = 'eid')

merged_df.rename(columns = {'designation' : 'position'}, inplace = True)
print(merged_df)

   eid  ename  stipend    position
0  101   Babu    50000     Manager
1  102  Theng    60000     Analyst
2  103  vazha    75000  Supervisor
3  104   plav    55000     Trainee